In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('../data/cleaned_bird_list.csv')

In [6]:
df.head()

,common_name,count,scientific_name,primary_label,IUCN Red List category (Europe),IUCN Red List category (EU27+UK)
0,Arctic Tern,162,sterna paradisaea,arcter,LC,LC
1,Bank Swallow,86,riparia riparia,banswa,LC,LC
2,Barn Owl,387,tyto alba,brnowl,LC,LC
3,Barn Swallow,981,hirundo rustica,barswa,LC,LC
4,Black Francolin,6,francolinus francolinus,blkfra,LC,LC

In [ ]:
df.drop(columns=['IUCN Red List category (Europe)'], inplace=True)

KeyError: "['IUCN Red List category (Europe)'] not found in axis"

In [9]:
df.head()

,common_name,count,scientific_name,primary_label,IUCN Red List category (EU27+UK)
0,Arctic Tern,162,sterna paradisaea,arcter,LC
1,Bank Swallow,86,riparia riparia,banswa,LC
2,Barn Owl,387,tyto alba,brnowl,LC
3,Barn Swallow,981,hirundo rustica,barswa,LC
4,Black Francolin,6,francolinus francolinus,blkfra,LC

In [10]:
df.rename(columns={'IUCN Red List category (EU27+UK)': 'Red List Status'}, inplace=True)

In [11]:
df.head()

,common_name,count,scientific_name,primary_label,Red List Status
0,Arctic Tern,162,sterna paradisaea,arcter,LC
1,Bank Swallow,86,riparia riparia,banswa,LC
2,Barn Owl,387,tyto alba,brnowl,LC
3,Barn Swallow,981,hirundo rustica,barswa,LC
4,Black Francolin,6,francolinus francolinus,blkfra,LC

In [13]:
df['Red List Status'].unique()

array(['LC', 'NT', 'VU', 'EN', 'VU°°', 'VU°'], dtype=object)

In [ ]:
df['Red List Status'].replace({'NT': 'VU', 'VU°': 'VU', 'VU°°': 'VU'}, inplace=True)

In [15]:
df.head()

,common_name,count,scientific_name,primary_label,Red List Status
0,Arctic Tern,162,sterna paradisaea,arcter,LC
1,Bank Swallow,86,riparia riparia,banswa,LC
2,Barn Owl,387,tyto alba,brnowl,LC
3,Barn Swallow,981,hirundo rustica,barswa,LC
4,Black Francolin,6,francolinus francolinus,blkfra,LC

In [16]:
df['Red List Status'].unique()

array(['LC', 'VU', 'EN'], dtype=object)

In [17]:
df.to_csv('final_bird_list.csv', index=False)

In [1]:
import pandas as pd
import numpy as np
df1 = pd.read_csv('../data/finally_bird_list.csv')
#df2 = pd.read_csv('../data/european_birds.csv')

In [3]:
df1['secondary_labels'] = None
df1['secondary_labels'] = df2['secondary_labels']

NameError: name 'df2' is not defined

In [2]:
df1.head()

    common_name  count    scientific_name primary_label Red List Status
0   Arctic Tern    162  sterna paradisaea        arcter              LC
1  Bank Swallow     86    riparia riparia        banswa              LC
2      Barn Owl    387          tyto alba        brnowl              LC
3  Barn Swallow    981    hirundo rustica        barswa              LC
4    Black Kite    225     milvus migrans       blakit1              LC

In [5]:
df1['secondary_labels'].nunique()

0

In [3]:
df2 = pd.read_csv('../data/european_birds.csv')

In [ ]:
df2.head()

,primary_label,secondary_labels,type,latitude,longitude,scientific_name,common_name,date,filename,license,rating,time,geometry
0,amtspa,[],['call'],55.6237,13.2427,Spizelloides arborea,American Tree Sparrow,2016-11-12,XC342444.ogg,Creative Commons Attribution-NonCommercial-Sha...,2.0,14:00,POINT (13.2427 55.6237)
1,amtspa,[],['call'],55.6237,13.2427,Spizelloides arborea,American Tree Sparrow,2016-11-16,XC342952.ogg,Creative Commons Attribution-NonCommercial-Sha...,3.0,08:31,POINT (13.2427 55.6237)
2,amtspa,[],['call'],55.6237,13.2427,Spizelloides arborea,American Tree Sparrow,2016-11-16,XC342954.ogg,Creative Commons Attribution-NonCommercial-Sha...,4.0,10:28,POINT (13.2427 55.6237)
3,banswa,[],['call'],54.5592,11.9695,Riparia riparia,Bank Swallow,2013-06-08,XC138517.ogg,Creative Commons Attribution-NonCommercial-Sha...,4.0,05:18,POINT (11.9695 54.5592)
4,banswa,[],"['alarm call', 'call']",46.1374,5.9609,Riparia riparia,Bank Swallow,2013-07-13,XC142649.ogg,Creative Commons Attribution-NonCommercial-Sha...,3.5,09:00,POINT (5.9609 46.1374)

In [ ]:
df2.drop(columns=['secondary_labels', 'type', 'latitude', 'longitude', 'license', 'rating', 'time', 'geometry'], inplace=True)
df2.head()

,primary_label,scientific_name,common_name,date,filename
0,amtspa,Spizelloides arborea,American Tree Sparrow,2016-11-12,XC342444.ogg
1,amtspa,Spizelloides arborea,American Tree Sparrow,2016-11-16,XC342952.ogg
2,amtspa,Spizelloides arborea,American Tree Sparrow,2016-11-16,XC342954.ogg
3,banswa,Riparia riparia,Bank Swallow,2013-06-08,XC138517.ogg
4,banswa,Riparia riparia,Bank Swallow,2013-07-13,XC142649.ogg

In [ ]:
df2.to_csv('grouping_list.csv', index=False)

In [ ]:
df2['filename'].nunique()

24055

In [4]:
# Create a mapping from primary_label to Red List Status
red_list_status_mapping = df1.set_index('primary_label')['Red List Status'].to_dict()

# Add the Red List Status to df2 based on the primary_label
df2['Red List Status'] = df2['primary_label'].map(red_list_status_mapping)

# Display the updated dataframe
df2.head()

,primary_label,secondary_labels,type,latitude,longitude,scientific_name,common_name,date,filename,license,rating,time,geometry,Red List Status
0,amtspa,[],['call'],55.6237,13.2427,Spizelloides arborea,American Tree Sparrow,2016-11-12,XC342444.ogg,Creative Commons Attribution-NonCommercial-Sha...,2.0,14:00,POINT (13.2427 55.6237),NaN
1,amtspa,[],['call'],55.6237,13.2427,Spizelloides arborea,American Tree Sparrow,2016-11-16,XC342952.ogg,Creative Commons Attribution-NonCommercial-Sha...,3.0,08:31,POINT (13.2427 55.6237),NaN
2,amtspa,[],['call'],55.6237,13.2427,Spizelloides arborea,American Tree Sparrow,2016-11-16,XC342954.ogg,Creative Commons Attribution-NonCommercial-Sha...,4.0,10:28,POINT (13.2427 55.6237),NaN
3,banswa,[],['call'],54.5592,11.9695,Riparia riparia,Bank Swallow,2013-06-08,XC138517.ogg,Creative Commons Attribution-NonCommercial-Sha...,4.0,05:18,POINT (11.9695 54.5592),LC
4,banswa,[],"['alarm call', 'call']",46.1374,5.9609,Riparia riparia,Bank Swallow,2013-07-13,XC142649.ogg,Creative Commons Attribution-NonCommercial-Sha...,3.5,09:00,POINT (5.9609 46.1374),LC

In [6]:
df2['Red List Status'].unique()

array([nan, 'LC', 'VU', 'EN'], dtype=object)

In [7]:
nan_count = df2['Red List Status'].isna().sum()
print(nan_count)

1419

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26922 entries, 0 to 26921
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   primary_label     26922 non-null  object
 1   secondary_labels  26922 non-null  object
 2   type              26922 non-null  object
 3   latitude          26922 non-null  float64
 4   longitude         26922 non-null  float64
 5   scientific_name   26922 non-null  object
 6   common_name       26922 non-null  object
 7   date              4829 non-null   object
 8   filename          26922 non-null  object
 9   license           26922 non-null  object
 10  rating            26922 non-null  float64
 11  time              10784 non-null  object
 12  geometry          26922 non-null  object
 13  Red List Status   25503 non-null  object
dtypes: float64(3), object(11)
memory usage: 2.9+ MB

In [9]:
df2.to_csv('basemodel_list.csv', index=False)